# 그룹 안에서 결측치 처리

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'group':['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'], 
                   'col_1':[1, np.nan, 3, 4, 5, np.nan, 7, 8], 
                   'col_2':[0.1, np.nan, 0.3, 0.4, 0.5, np.nan, 0.7, 0.8]})
df

  group  col_1  col_2
0     a    1.0    0.1
1     a    NaN    NaN
2     a    3.0    0.3
3     a    4.0    0.4
4     b    5.0    0.5
5     b    NaN    NaN
6     b    7.0    0.7
7     b    8.0    0.8

## group.apply(fillna) 방법
* Reference: https://rfriend.tistory.com/402

**fillna(series)인 경우 어떻게 작동하는지 확인**

In [15]:
# group a만 뽑은 dataframe 만들어서 fillna 해보기
a = df.loc[0:3]
mn = a.mean()     # series
a.fillna(mn, axis=0)      # series의 index와 dataframe의 column을 맞추어서 치환

  group     col_1     col_2
0     a  1.000000  0.100000
1     a  2.666667  0.266667
2     a  3.000000  0.300000
3     a  4.000000  0.400000

> axis=1로 설정한 경우 오류 메세지: **Currently only can fill with dict/Series column by column**

In [4]:
# NaN을 채우기 위한 평균값
df.groupby('group').mean()

          col_1     col_2
group
a      2.666667  0.266667
b      6.666667  0.666667

In [7]:
df.groupby('group').apply(lambda x: x.mean())    # 위와 같은 결과

          col_1     col_2
group
a      2.666667  0.266667
b      6.666667  0.666667

In [16]:
df.groupby('group').apply(lambda x: x.fillna(x.mean()))

        group     col_1     col_2
group
a     0     a  1.000000  0.100000
      1     a  2.666667  0.266667
      2     a  3.000000  0.300000
      3     a  4.000000  0.400000
b     4     b  5.000000  0.500000
      5     b  6.666667  0.666667
      6     b  7.000000  0.700000
      7     b  8.000000  0.800000